Revit 2027 API
StructuralFramingUtils Methods
The StructuralFramingUtils type exposes the following members.
Methods
Name | Description
AllowJoinAtEnd |  Sets the indicated end of the framing element to be allowed to join to others.
CanFlipEnds |  Determines if the ends of the given framing element can be flipped.
CanSetEndReference |  Determines if a reference can be set for the given end of the framing element.
DisallowJoinAtEnd |  Sets the indicated end of the framing element to not be allowed to join to others.
FlipEnds |  Flips the ends of the structural framing element.
GetEndReference |  Returns a reference to the end of a framing element according to the setback settings.
IsEndReferenceValid |  Determines if the given reference can be set for the given end of the framing element.
IsJoinAllowedAtEnd |  Identifies if the indicated end of the framing element is allowed to join to others.
RemoveEndReference |  Resets the end reference of the structural framing element.
SetEndReference |  Sets the end reference of a framing element.
Top
See Also
Reference
StructuralFramingUtils Class
Autodesk.Revit.DB.Structure Namespace